package test.ch07.Test;

public class Test {

	
	/*
	 * 1번문제 답 : 2
	 * 
	 * 2번문제 답 : 2
	 * 
	 * 3번문제 답 : 1
	 * 
	 * 4번문제 답 : 2
	 * 
	 * 5번문제 답 : 1
	 */
	
	
	public static void main(String[] args) {
	/*	
	6번문제
	답 : Parent 클래스의 메소드 타입을 void로 바꾸어줘야 한다. 이유는 리턴 할 값이 없어서...?
	*/
		
	/*
	 * 7번문제
	 */
		
		
	/*
	 * 8번문제
	 * 스노우 타이어가 굴러갑니다.
	 * 스노우 타이어가 굴러갑니다.
	 * 
	 * 새로운 객체 SnowTire가 snowTire에 저장이 되었고
	 * snowTire가 tire에 저장이 되어서 둘은 같아졌다...?
	 */
		
		
	/*
	 * 9번문제
	 * 답 : 3번
	 */
		
		
	/*
	 * 10번문제
	 * 답
	 * 1. 공통된 필드와 메소드의 이름을 통일해야 한다.
	 */
		
	/*
	 * 	11번 문제
	 * 
	 */
		
		
		
		
	
		
	}

}
